//
//  File.swift
//  
//
//  Created by 성재 on 7/13/24.
//

import Foundation

class SentData_ja : LanguageConfigurable {
    let def = [
        "今日の日記を書いて達成感を感じましょう！",
        "小さな記録が大きな変化をもたらします。日記を書いてみましょう！",
        "日記を書いて自分をもっと知りましょう！",
        "毎日の記録があなたを成長させます！",
        "日記を書いて一日を整理しましょう。より良い明日が待っています！",
        "日記とともに一日を締めくくりながら心の平和を見つけましょう！",
        "日記を書く習慣があなたの人生を変えるでしょう！",
        "自分の物語を記録してさらに逞しくなりましょう！",
        "毎日日記を書いて自ら元気付けましょう！",
        "あなたの一日を記録して新たなモチベーションを探してみましょう！"
    ]
    
    let que = [
        "今日一日の中で最も記憶に残っている瞬間はいつですか？",
        "今日新しく学んだことは何ですか？",
        "今日あなたを最も笑顔にさせたことは何でしたか？",
        "今日一日の中でありがたいと思った瞬間を書いてみましょう。",
        "今日の目標を達成するためにどのような努力をしましたか？",
        "今日あなたを最もチャレンジさせたことは何でしたか？",
        "今日一日を通して学んだ教訓は何ですか？",
        "今日誰かの役に立ちましたか？または手助けをもらいましたか？",
        "今日あなたを最も誇らしくさせた瞬間はいつでしたか？",
        "今日一日を通してより頑張ったことは何でしたか？"
    ]
    
    let emo = [
        "今日一日の感情を日記に書き出してみましょう。",
        "あなたの心の声を書いてみましょう。誰よりもあなたが大切です。",
        "辛い時は、書き出すだけでも気持ちが楽になります。",
        "あなたの日記はあなただけの特別な空間です。心ゆくまで書きましょう。",
        "今日感じた愛情と感謝を日記に残しましょう。",
        "胸の奥で感じた今日の瞬間を記録しましょう。",
        "悲しみも嬉しみもすべて大切な思い出になります。今日の感情を綴ってみましょう。",
        "心の声に耳を傾けてみましょう。そして日記に書き出しましょう。",
        "日記を書いて気持ちを軽くしましょう。あなたは一人ではありません。",
        "あなたの感情を正直に表現できる日記の時間を作りましょう。"
    ]
    
    let quo = [
        "「記録しなければ消えてしまう。」",
        "「一日の終わりは新たな始まりだ。」",
        "「今日の小さな一歩が明日の大きな飛躍につながる。」",
        "「記録は記憶をつなぎとめる鎖である。」",
        "「あなたの物語には価値があります。」",
        "「毎日の記録は未来の宝です。」",
        "「人生は記録する価値のある冒険です。」",
        "「日記は心の鏡だ。」",
        "「記録は時の中に眠る宝物だ。」",
        "「日記は魂のささやきである。」"
    ]
    
    let reg = [
        "今日一日を振り返りながら感じた点を綴ってみましょう。",
        "自分を見つめ直す時間を取りましょう。日記を書いてみましょう。",
        "今日一日の中で最も有意義な瞬間はいつでしたか？",
        "今日あなたを最も喜ばせたことは何でしたか？",
        "今日一日のあなたの感情はどうでしたか？",
        "今日の達成と学びを記録しましょう。",
        "今日経験した挑戦と克服について書いてみましょう。",
        "今日あなたを幸せにした些細な出来事を書き出してみましょう。",
        "今日一日の間でありがたいと思った瞬間を綴ってみましょう。",
        "今日のあなたの考えと感情を正直に書いてみましょう。"
    ]
}
